dnxo1224/ESP-C6-realtime-analyzer/firmware/csi_relay/sdkconfig.defaults
# Convergecast Relay (Data Forwarder) — ESP32-S3
# UART 프레임 수신 + Wi-Fi STA + 서버 포워딩.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_OFFSET=0xa000
# 로그 콘솔은 USB-Serial/JTAG (보드가 USJ로 열거되는 포트 구성)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
# 통계 주기와 재접속 백오프에 1ms 틱 사용
CONFIG_FREERTOS_HZ=1000
